Autodesk.Revit.DB.SelectionFilterElement.Clear
Removes all ElementIds from the filter.
Since:
2013

Autodesk.Revit.DB.SelectionFilterElement.Contains(Autodesk.Revit.DB.ElementId)
Returns true if the given ElementId is a member of this filter's set.
id:
The ElementId to look for.
Returns:
True if the given ElementId is a member of the filter, otherwise false.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Invalid ElementId
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.SelectionFilterElement.RemoveSet(System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId})
Removes a set of ElementIds from the filter's set.
ids:
The set of ElementIds to remove.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.SelectionFilterElement.RemoveSingle(Autodesk.Revit.DB.ElementId)
Removes a single ElementId from the filter's set.
id:
The ElementId to remove.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Invalid ElementId
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.SelectionFilterElement.AddSet(System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId})
Adds a set of ElementIds to the filter's set.
ids:
The set of ElementIds to add.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.SelectionFilterElement.AddSingle(Autodesk.Revit.DB.ElementId)
Adds a single ElementId to the filter's set.
id:
The ElementId to add.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Invalid ElementId
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.SelectionFilterElement.IsEmpty
Determines whether this filter's set is empty or not.
Returns:
True if the set is empty, otherwise false.
Since:
2013

Autodesk.Revit.DB.SelectionFilterElement.GetElementIds
Returns the set of ElementIds contained by this filter.
Returns:
The set of ElementIds.
Since:
2013

Autodesk.Revit.DB.SelectionFilterElement.SetElementIds(System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId})
Replaces the set of ElementIds contained by this filter.
ids:
The new set of ElementIds.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.SelectionFilterElement.Create(Autodesk.Revit.DB.Document,System.String)
Creates a new SelectionFilterElement in the given document.
document:
The document in which to create the SelectionFilterElement.
name:
The name for the new SelectionFilterElement.
Returns:
The new SelectionFilterElement.
Throws Autodesk.Revit.Exceptions.ArgumentException:
name is an empty string or contains only whitespace.
-or-
name cannot include prohibited characters.
-or-
The given value for name is already in use as a filter element name.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.SelectionFilterElement
A filter element that stores an explicit list of ElementIds.
Only elements whose ElementIds are in this list will pass the filter.
Since:
2013